# 请在这里进行修改，可以自行添加圣遗物组合
# 每个组合为一个三维list
# 第一维标号0 - 4，分别代表生命值，攻击力，防御力，元素充能效率和元素精通
# 第二维标号0 - 10，分别代表生命值，攻击力，防御力，火、雷、冰、水、风、岩伤害加成和物理伤害加成以及元素精通
# 第三维标号0 - 6，分别代表生命值，攻击力，防御力，暴击率，暴击伤害，治疗加成和元素精通的概率

# 生命套
life_comb = [
    [0, 0, 0]
]

# 攻击套
attack_comb = [
    [1, 1, 1]
]

# 防御套
defense_comb = [
    [2, 2, 2]
]

# 攻爆套
attack_critical_comb = [
    [1, 1, 4],
    [1, 1, 5]
]

# 精通套
mastery_comb = [
    [4, 10, 6]
]

# 精爆套
mastery_critical_comb = [
    [4, 10, 4],
    [4, 10, 5]
]


# 精爆或者精通套
master_or_master_critical_comb = [
    [4, 10, 4],
    [4, 10, 5],
    [4, 10, 6]
]

my_comb = [

]

# 将这里改成要测试的套装
test_comb = life_comb

# 这里设置出货期限，设置为-1表示不考虑该参数
ddl = 4